    
Функция СведенияОВнешнейОбработке() Экспорт 
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.Совмещение");
	ПараметрыРегистрации.Вставить("Вид","ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение",МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование","Приказ и ДС о совмещении должностей с логотипом");
	ПараметрыРегистрации.Вставить("Версия","1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Истина);
	ПараметрыРегистрации.Вставить("Информация","Приказ и ДС о совмещении должностей с логотипом");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,	"Приказ и ДС о совмещении должностей с логотипом", "ВПФ_MXL_ПраказНаСовмещениеДолжностей", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды; 
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ПараметрыПечати = Неопределено) Экспорт
	
	ПараметрыПечати = Новый Структура;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВПФ_MXL_ПраказНаСовмещениеДолжностей") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВПФ_MXL_ПраказНаСовмещениеДолжностей",
		НСтр("ru = 'Приказ и ДС о совмещении должностей с логотипом';
		|en = 'Transfer note'"),
		СформироватьПриказ(МассивОбъектов[0], ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры    


Функция СформироватьПриказ(СсылкаНаОбъект, ОбъектыПечати, ПараметрыПечати) Экспорт   
	
	УстановитьПривилегированныйРежим(Истина);
	//получаем документ основание
	Документ = СсылкаНаОбъект.Ссылка;
	
	//получаем данные для печати
	
	
	//формируем табличный документ
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати =  "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказНаСовмещение";
	ТабДокумент.ПолеСлева = 18;
	ТабДокумент.ПолеСправа = 10;
	ТабДокумент.ПолеСнизу = 10;
	ТабДокумент.ПолеСверху = 10;
	
	//Получаем макет
	
	Макет = ПолучитьМакет("ВПФ_MXL_ПраказНаСовмещениеДолжностей");
	
	//обозначаем области
	
	ОбластьМакетШапка           = Макет.ПолучитьОбласть("Шапка");
	
	
	//выводим область
	
	ТабДокумент.Вывести(ОбластьМакетШапка);
	
	
	
	Возврат ТабДокумент;

КонецФункции





