    
Функция СведенияОВнешнейОбработке() Экспорт 
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.Совмещение");
	ПараметрыРегистрации.Вставить("Вид","ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение",МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование","Приказ и ДС о совмещении должностей с логотипом");
	ПараметрыРегистрации.Вставить("Версия","1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Истина);
	ПараметрыРегистрации.Вставить("Информация","Приказ и ДС о совмещении должностей с логотипом");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,	"Приказ и ДС о совмещении должностей с логотипом", "ВПФ_MXL_ПраказНаСовмещениеДолжностей", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды; 
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ПараметрыПечати = Неопределено) Экспорт
	
	ПараметрыПечати = Новый Структура;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВПФ_MXL_ПраказНаСовмещениеДолжностей") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВПФ_MXL_ПраказНаСовмещениеДолжностей",
		НСтр("ru = 'Приказ и ДС о совмещении должностей с логотипом';
		|en = 'Transfer note'"),
		СформироватьПриказ(МассивОбъектов[0], ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры    


Функция СформироватьПриказ(СсылкаНаОбъект, ОбъектыПечати, ПараметрыПечати) Экспорт   
	
	УстановитьПривилегированныйРежим(Истина);
	//получаем документ основание
	Документ = СсылкаНаОбъект.Ссылка;
	
	//получаем данные для печати
	
	
	//формируем табличный документ
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати =  "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказНаСовмещение";
	ТабДокумент.ПолеСлева = 18;
	ТабДокумент.ПолеСправа = 10;
	ТабДокумент.ПолеСнизу = 10;
	ТабДокумент.ПолеСверху = 10;
	
	//Получаем макет
	
	Макет = ПолучитьМакет("ВПФ_MXL_ПраказНаСовмещениеДолжностей");
	
	//обозначаем области
	
	ОбластьМакетЛого = Макет.ПолучитьОбласть("Лого");
	ОбластьМакетЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетПреамбула = Макет.ПолучитьОбласть("Преамбула");
	//выводим область
	
	
	ОбластьМакетПреамбула.Параметры.ОтсутствующийСотрудник = Документ.ОтсутствующийСотрудник;
		
	
	//заполняем пункт 1.
	СсылкаНаСовмещающего =  Документ.СовмещающийСотрудник;
	СсылкаНаОтсутствующего =  Документ.ОтсутствующийСотрудник;
	
	//получаем должность совмещающего
	   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
		|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", СсылкаНаСовмещающего);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ДолжностьСотрудника = ВыборкаДетальныеЗаписи.Должность;
		ПодразделениеСотрудника = ВыборкаДетальныеЗаписи.Подразделение;
	КонецЦикла;
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	ТабДокумент.Вывести(ОбластьМакетПреамбула);
	

	ТабДокумент.Вывести(ОбластьМакетЛого); 
	ТабДокумент.Вывести(ОбластьМакетЗаголовок);

	Возврат ТабДокумент;
	
	//получить дольжность
	
	
	
КонецФункции





